WcfMovieService/Examples/El Padrino.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:wcf="http://schemas.datacontract.org/2004/07/WcfMovieService">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:AddMovie>
         <tem:movie>
            <wcf:Code>MDE7946321</wcf:Code>
            <wcf:Director>Francis Ford Coppola</wcf:Director>
            <wcf:Id>0</wcf:Id>
            <wcf:Title>The Godfather</wcf:Title>
            <wcf:Year>1972</wcf:Year>
         </tem:movie>
      </tem:AddMovie>
   </soapenv:Body>
</soapenv:Envelope>